*** src/book.rs:26:9: replace <impl Display for Book>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/book.rs
+++ replace <impl Display for Book>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -18,15 +18,11 @@
             quantity,
             price,
         }
     }
 }
 
 impl std::fmt::Display for Book {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        write!(
-            f,
-            "Title: {}, Author: {}, Genre: {}, Quantity: {}, Price: {},",
-            &self.title, &self.author, &self.genre, &self.quantity, &self.price
-        )
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
