*** src/inventory.rs:141:9: replace Inventory::sell_book -> Result<(), Box<dyn Error>> with Ok(())

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::sell_book -> Result<(), Box<dyn Error>> with Ok(())
@@ -133,22 +133,17 @@
         }
     }
 
     pub fn sell_book(
         &mut self,
         book_index: usize,
         sell_quantity: u32,
     ) -> Result<(), Box<dyn Error>> {
-        if &sell_quantity == &self.books[book_index].quantity {
-            self.remove(book_index)
-        } else {
-            self.books[book_index].quantity -= sell_quantity;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn save(&self) -> Result<(), Box<dyn Error>> {
         let mut path = OpenOptions::new().write(true).open(PATH)?;
         let serialized = serde_json::to_string(&self)?;
 
         path.seek(std::io::SeekFrom::Start(0))?;
         path.set_len(0)?;

---- tests::tests::test_sell_book stdout ----
thread 'tests::tests::test_sell_book' panicked at src/tests.rs:93:9:
assertion `left == right` failed
  left: 10
 right: 5

---- tests::tests::test_sell_book_2 stdout ----
thread 'tests::tests::test_sell_book_2' panicked at src/tests.rs:102:9:
assertion `left == right` failed
  left: 15
 right: 1

failures:
    tests::tests::test_sell_book
    tests::tests::test_sell_book_2

test result: FAILED. 12 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
