*** src/inventory.rs:30:9: replace Inventory::remove with ()

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::remove with ()
@@ -22,17 +22,17 @@
             self.books.push(b);
             Ok(())
         } else {
             Err("Cannot add any more books".into())
         }
     }
 
     pub fn remove(&mut self, b: usize) {
-        self.books.remove(b);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn update(
         &mut self,
         index: usize,
         field: String,
         update: String,
     ) -> Result<(), Box<dyn Error>> {

---- tests::tests::test_remove_book stdout ----
thread 'tests::tests::test_remove_book' panicked at src/tests.rs:55:9:
assertion `left == right` failed
  left: Some(0)
 right: None

failures:
    tests::tests::test_remove_book

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
