*** src/inventory.rs:39:9: replace Inventory::update -> Result<(), Box<dyn Error>> with Ok(())

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::update -> Result<(), Box<dyn Error>> with Ok(())
@@ -31,42 +31,17 @@
     }
 
     pub fn update(
         &mut self,
         index: usize,
         field: String,
         update: String,
     ) -> Result<(), Box<dyn Error>> {
-        let book = match self.books.get_mut(index) {
-            None => return Err("None existing book".into()),
-            Some(b) => b,
-        };
-        match field.as_str() {
-            "title" => book.title = update,
-            "author" => book.author = update,
-            "genre" => book.genre = update,
-            "price" => {
-                if let Ok(price) = update.parse::<u32>() {
-                    book.price = price;
-                } else {
-                    return Err("Invalid price format".into());
-                }
-            }
-            "quantity" => {
-                if let Ok(quantity) = update.parse::<u32>() {
-                    book.quantity = quantity;
-                } else {
-                    return Err("Invalid quantity format".into());
-                }
-            }
-            _ => return Err("Invalid field".into()),
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn display(
         &mut self,
         criteria: &str,
         book_position: Option<usize>,
     ) -> Result<(), Box<dyn Error>> {
         match criteria {

---- tests::tests::test_update_book stdout ----
thread 'tests::tests::test_update_book' panicked at src/tests.rs:70:9:
assertion `left == right` failed
  left: "Book 1"
 right: "Updated Book"

failures:
    tests::tests::test_update_book

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
