*** src/inventory.rs:72:9: replace Inventory::display -> Result<(), Box<dyn Error>> with Ok(())

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::display -> Result<(), Box<dyn Error>> with Ok(())
@@ -64,78 +64,17 @@
         Ok(())
     }
 
     pub fn display(
         &mut self,
         criteria: &str,
         book_position: Option<usize>,
     ) -> Result<(), Box<dyn Error>> {
-        match criteria {
-            "author" => {
-                println!("Books are sorted by author:\n");
-                self.books.sort_by_key(|x| x.author.clone());
-                for book in &self.books {
-                    println!("{book}");
-                }
-                println!();
-                Ok(())
-            }
-            "title" => {
-                println!("Books are sorted by title:\n");
-                self.books.sort_by_key(|x| x.title.clone());
-                for book in &self.books {
-                    println!("{book}");
-                }
-                println!();
-                Ok(())
-            }
-            "genre" => {
-                println!("Books are sorted by genre:\n");
-                self.books.sort_by_key(|x| x.genre.clone());
-                for book in &self.books {
-                    println!("{book}");
-                }
-                println!();
-                Ok(())
-            }
-            "quantity" => {
-                println!("Books are sorted by quantity:\n");
-                self.books.sort_by_key(|x| x.quantity.clone());
-                for book in &self.books {
-                    println!("{book}");
-                }
-                println!();
-                Ok(())
-            }
-            "price" => {
-                println!("Books are sorted by price:\n");
-                self.books.sort_by_key(|x| x.price.clone());
-                for book in &self.books {
-                    println!("{book}");
-                }
-                println!();
-                Ok(())
-            }
-            "all" => {
-                println!("Books in the inventory:\n");
-                for book in &self.books {
-                    println!("{book}");
-                }
-                println!();
-                Ok(())
-            }
-            "book" => {
-                let book_position = book_position.unwrap_or_default();
-                println!("Specific book:\n");
-                println!("{}", &self.books[book_position]);
-                Ok(())
-            }
-            _ => Err("Invalid criteria".into()),
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn sell_book(
         &mut self,
         book_index: usize,
         sell_quantity: u32,
     ) -> Result<(), Box<dyn Error>> {
         if &sell_quantity == &self.books[book_index].quantity {

---- tests::tests::test_display_books stdout ----
thread 'tests::tests::test_display_books' panicked at src/tests.rs:109:9:
assertion failed: inventory.display("asdasdsa", None).is_err()

failures:
    tests::tests::test_display_books

test result: FAILED. 13 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
