*** src/lib.rs:56:5: replace get_command -> String with String::new()

*** mutation diff:
--- src/lib.rs
+++ replace get_command -> String with String::new()
@@ -48,17 +48,10 @@
         Ok(inventory) => inventory,
         Err(_) => Inventory { books: vec![] },
     };
 
     Ok(data)
 }
 
 pub fn get_command(command: &str) -> String {
-    print!("Enter a command {}: ", command);
-    std::io::stdout().flush().unwrap();
-
-    let mut input = String::new();
-    std::io::stdin().read_line(&mut input).unwrap();
-
-    let input = input.trim().to_string();
-    input
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
