*** src/inventory.rs:150:9: replace Inventory::save -> Result<(), Box<dyn Error>> with Ok(())

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::save -> Result<(), Box<dyn Error>> with Ok(())
@@ -142,24 +142,17 @@
             self.remove(book_index)
         } else {
             self.books[book_index].quantity -= sell_quantity;
         }
         Ok(())
     }
 
     pub fn save(&self) -> Result<(), Box<dyn Error>> {
-        let mut path = OpenOptions::new().write(true).open(PATH)?;
-        let serialized = serde_json::to_string(&self)?;
-
-        path.seek(std::io::SeekFrom::Start(0))?;
-        path.set_len(0)?;
-        path.write_all(&serialized.as_bytes())?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_index(&self, book: &str) -> Option<usize> {
         self.books
             .iter()
             .position(|x| x.title.to_lowercase() == book.to_lowercase())
     }
 }

*** result: Success
