*** src/inventory.rs:161:9: replace Inventory::get_index -> Option<usize> with None

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::get_index -> Option<usize> with None
@@ -153,13 +153,11 @@
         path.seek(std::io::SeekFrom::Start(0))?;
         path.set_len(0)?;
         path.write_all(&serialized.as_bytes())?;
 
         Ok(())
     }
 
     pub fn get_index(&self, book: &str) -> Option<usize> {
-        self.books
-            .iter()
-            .position(|x| x.title.to_lowercase() == book.to_lowercase())
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- tests::tests::test_get_index stdout ----
thread 'tests::tests::test_get_index' panicked at src/tests.rs:115:9:
assertion `left == right` failed
  left: None
 right: Some(0)

---- tests::tests::test_add_book stdout ----
thread 'tests::tests::test_add_book' panicked at src/tests.rs:46:63:
called `Option::unwrap()` on a `None` value

---- tests::tests::test_remove_book stdout ----
thread 'tests::tests::test_remove_book' panicked at src/tests.rs:53:56:
called `Option::unwrap()` on a `None` value

failures:
    tests::tests::test_add_book
    tests::tests::test_get_index
    tests::tests::test_remove_book
    tests::tests::test_sell_book
    tests::tests::test_sell_book_2
    tests::tests::test_sell_more_than_available
    tests::tests::test_sell_more_than_available_2
    tests::tests::test_update_book
    tests::tests::test_update_book_1

test result: FAILED. 5 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
