*** src/inventory.rs:161:9: replace Inventory::get_index -> Option<usize> with Some(1)

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::get_index -> Option<usize> with Some(1)
@@ -153,13 +153,11 @@
         path.seek(std::io::SeekFrom::Start(0))?;
         path.set_len(0)?;
         path.write_all(&serialized.as_bytes())?;
 
         Ok(())
     }
 
     pub fn get_index(&self, book: &str) -> Option<usize> {
-        self.books
-            .iter()
-            .position(|x| x.title.to_lowercase() == book.to_lowercase())
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 }

---- tests::tests::test_get_index stdout ----
thread 'tests::tests::test_get_index' panicked at src/tests.rs:115:9:
assertion `left == right` failed
  left: Some(1)
 right: Some(0)

---- tests::tests::test_remove_book stdout ----
thread 'tests::tests::test_remove_book' panicked at src/tests.rs:55:9:
assertion `left == right` failed
  left: Some(1)
 right: None

---- tests::tests::test_non_existing_book stdout ----
thread 'tests::tests::test_non_existing_book' panicked at src/tests.rs:151:9:
assertion `left == right` failed
  left: Some(1)
 right: None

failures:
    tests::tests::test_get_index
    tests::tests::test_non_existing_book
    tests::tests::test_remove_book

test result: FAILED. 11 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
