*** src/inventory.rs:20:9: replace Inventory::add -> Result<(), Box<dyn Error>> with Ok(())

*** mutation diff:
--- src/inventory.rs
+++ replace Inventory::add -> Result<(), Box<dyn Error>> with Ok(())
@@ -12,23 +12,17 @@
     pub books: Vec<Book>,
 }
 
 impl Inventory {
     pub fn new() -> Self {
         Inventory { books: Vec::new() }
     }
     pub fn add(&mut self, b: Book) -> Result<(), Box<dyn Error>> {
-        let max_capacity = 30;
-        if self.books.len() < max_capacity {
-            self.books.push(b);
-            Ok(())
-        } else {
-            Err("Cannot add any more books".into())
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn remove(&mut self, b: usize) {
         self.books.remove(b);
     }
 
     pub fn update(
         &mut self,

---- tests::tests::test_add_max_capacity stdout ----
thread 'tests::tests::test_add_max_capacity' panicked at src/tests.rs:174:9:
assertion failed: inventory.add(new_book).is_err()

---- tests::tests::test_remove_book stdout ----
thread 'tests::tests::test_remove_book' panicked at src/tests.rs:53:56:
called `Option::unwrap()` on a `None` value

---- tests::tests::test_get_index stdout ----
thread 'tests::tests::test_get_index' panicked at src/tests.rs:115:9:
assertion `left == right` failed
  left: None
 right: Some(0)

failures:
    tests::tests::test_add_book
    tests::tests::test_add_max_capacity
    tests::tests::test_get_index
    tests::tests::test_remove_book
    tests::tests::test_sell_book
    tests::tests::test_sell_book_2
    tests::tests::test_sell_more_than_available
    tests::tests::test_sell_more_than_available_2
    tests::tests::test_update_book
    tests::tests::test_update_book_1

test result: FAILED. 4 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
